BenchBnB/app/controllers/api/users_controller.rb

    def create
        # debugger
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "name7"], ["email", "email"], ["password_digest", "$2a$12$cHCn6tkC4hir4FcW6laJwenCTFD/g6p6FnCl6qPsovy.RN..QKguu"], ["session_token", "5bIRUXIdypLZD0dBirk62Q"]]